---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ServerInternalException
source: html/fe27a4e7-0ed0-1de7-3584-b438ed279495.htm
---
# ServerInternalException Members

Retrieves data needed to serialize the target object.